Autodesk.Revit.CloudExternalData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.CloudExternalData.ProjectVersion
Project version.
Since:
2019

Autodesk.Revit.CloudExternalData.ProjectGuid
Project Guid from C4R.
Since:
2019

Autodesk.Revit.CloudExternalData.ProjectName
Project name.
Since:
2019

Autodesk.Revit.CloudExternalData.ProjectId
Project identity in BIM 360.
Since:
2019

Autodesk.Revit.CloudExternalData.HubId
Hub identity in BIM 360.
Since:
2019

Autodesk.Revit.CloudExternalData
The data that can be provided to the CloudExternalService.
Since:
2019